app/views/post_images/show.html.erb

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 5]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 6]]
---
    <div class="float-wrapper">
        <h2 class="comment-count"><%= @post_image.post_comments.count %>件コメント</h2>